from tkinter import *
from datetime import *
#ماژول پایین برای تقویم شمسیه که باید با پی آی پی تصبش کنین
#pip install jdatetime
#from jdatetime import *

#function
def now():
    x =  datetime.now().strftime('%D ~ %H : %M : %S %p')
    #درصد دی بزرگ که برای تقویم میلادی سال و ماه و روز رو نشون میده رو شمسی کار نمیکنه برای همینم از پایینیا استفاده کنین
    #کلا این درصدا هر کدوم یه بازه زمانیو نشون میدن مثلا درصد اس بزرگ ثانیرو نشون میده
    #x = datetime.now()strftime('%Y/%m/%d %H : %M : %S %p')
    lbl.config(text= x)
    win.after(1000, now)
    #تو کد بالا تعیین کردیم که هر چقدر زمان یه بار ریفرش بشه تایممون اگه اینو تعیین نکنیم هر بار که بازش میکنیم یه زمان ثابتو نشون میده
    #هزار برای اینه که ماژول دیت تایم *فکر کنم* واحدش میلی ثانیس
    #ya datetime ya now bood fek konam

#x = datetime.now().year
#x = datetime.now().hour
#اگه بخوایم مثلا فقط یهمون یه تایمو نشون بده مثلا فقط ساعت یا سال یا ... میتونیم از کدای بالا هم استفاده کنیم


win = Tk()
win.config(bg='darkcyan')

lbl = Label(text= '❤️' ,font=('tahoma', 50) , bg= 'darkcyan' , fg='white')
#قلبه مهم نیست فقط گذاستیم خالی نباشه
lbl.pack()
#lbl.grid()
#lbl.place(x=10,y=10)
#به جای پلیس میتونیم یه دفعه از پک استفاده کنیم دقیق بازم یادم نیست اینو حتما تو نت بزنین فرقاشونو ببینین ولی این خودش دیفالت تنظسم میکنه فکز کنم

#حتما باید تابعتونو اینجا هم تعریف کنین وگرنه کار نمیکنه
now()
mainloop()