#یزاس اجرای کدای پایین باید او اس رو ایمپورت کنین 
import os
#ماژول پایین برای دوتا خط آخره که با پی آی پی باید نصبش کنین
#import requests
#pip install requests

#با استفاده از کدای پایین میتونین با هر فرمت و اسمی که میخواین فایل ایجاد. پاک و ... کنین که اینم بزنین تو نت میاره که مثلا فزق ایکس با دبلیو چیه و هرکدوم چیکار میکنن
#f = open(file = 'text.txt', mode = 'x')
# f = open('text.txt','w')
#دوتا کد بالا هیچ فرقی با هم ندارن میتونین هم فایل و مود رو بنویسین و هم ننویسین
#W ba X fargh dare har kodoom ye kar anjam midan va aslan esmaye del bekhahi nistan
#print(f)
#os.remove('text.txt')

#کد بالا برای پاک کردن اون فایلیه که ساختیم.
#*هرکدوم از این کدارو میتونین از کامنت دربیارین امتحان کنین ببینین ساخته شده*

# x = input('Type Anything: ')
# f.write(x)
#دوتا کد بالا برا اینه که تو فایلی که ساختیم یه چیزی بنویسیم
#توجه داسته باشین که اول باید به استفاده از کدای خط هفت و هشت یه فایل تکست مثلا درست کنین که اف هم تعریف داشته باشه

# f = open('text.txt' ,  'r')
# print(f.read())
#دوتا کد بالا برای خوندن تکست تو فایلیه که ساختیم توجه کنین که باید اول فایلشم باشه که بخونه

# for i in range (1,21):
#     open(f'img0{i}.jpg', 'x')
#دوتا کد بالا برای اینه که مثلا بیست تا فایل درست کنیم
#ولی خب وقتی یه فایل با یه اسم درست کردیم دیگه تو همون فولدر نمیشه یه فایل دیگه با همون اسم درست کرد پس از اف استزینگ استفاده میکنیم تا اسماشون تغییر کنه هر دفعه

#data = requests.get('https://python.org')
#print(data.text)
#با کدای بالا میتونین تمام دیتای داخل یاست پایتون رو داشته باشین میتونه هر سایتی باشه که استاد گفت جلسه دیگه بیشتز توضیحش. میده